# Terraform plan for staging

```
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Terraform Plan Details</summary>

```
data.local_file.cluster_jwks: Reading...
data.local_file.cluster_jwks: Read complete after 0s [id=74d444353f8857b4548d3503841d068fe66386fc]
module.velero.google_service_account.velero: Refreshing state... [id=projects/stg-piny940/serviceAccounts/velero@stg-piny940.iam.gserviceaccount.com]
module.clubroom.google_storage_bucket.clubroom: Refreshing state... [id=stg-clubroom.piny940.com]
module.workload_identity_pool.google_project_service.iamcredentials: Refreshing state... [id=stg-piny940/iamcredentials.googleapis.com]
module.portfolio.google_storage_bucket.portfolio: Refreshing state... [id=stg-portfolio.piny940.com]
module.clubroom.google_service_account.clubroom: Refreshing state... [id=projects/stg-piny940/serviceAccounts/clubroom@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_service_account.terraform_github_actions: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.velero.google_storage_bucket.velero: Refreshing state... [id=stg-velero-cluster-backup.piny940.com]
module.workload_identity_pool.google_iam_workload_identity_pool.default: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool]
module.portfolio.google_service_account.portfolio: Refreshing state... [id=projects/stg-piny940/serviceAccounts/portfolio@stg-piny940.iam.gserviceaccount.com]
google_storage_bucket.terraform_remote_backend: Refreshing state... [id=stg-terraform-remote-backend.piny940.com]
module.clubroom.google_project_iam_member.clubroom_storage_object_user: Refreshing state... [id=stg-piny940/roles/storage.objectUser/serviceAccount:clubroom@stg-piny940.iam.gserviceaccount.com]
module.clubroom.google_project_iam_member.clubroom_service_account_token_creator: Refreshing state... [id=stg-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:clubroom@stg-piny940.iam.gserviceaccount.com]
module.velero.google_project_iam_member.velero_storage_object_user: Refreshing state... [id=stg-piny940/roles/storage.objectUser/serviceAccount:velero@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_iam_workload_identity_pool_provider.repo_github_actions: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool/providers/repo-github-actions]
module.kube_workload_identity.google_iam_workload_identity_pool_provider.home_kubernetes: Refreshing state... [id=projects/stg-piny940/locations/global/workloadIdentityPools/pool/providers/home-kubernetes]
module.clubroom.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/clubroom@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:stg-clubroom]
module.terraform.google_project_iam_member.terraform_github_actions_owner: Refreshing state... [id=stg-piny940/roles/owner/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.terraform.google_service_account_iam_member.terraform_github_actions_env_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:environment:staging]
module.terraform.google_service_account_iam_member.terraform_github_actions_pull_request_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:pull_request]
module.terraform.google_service_account_iam_member.terraform_github_actions_main_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/terraform-github-actions@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/repo:piny940/infra:ref:refs/heads/main]
module.terraform.google_project_iam_member.terraform_github_actions_workload_identity_user: Refreshing state... [id=stg-piny940/roles/iam.workloadIdentityUser/serviceAccount:terraform-github-actions@stg-piny940.iam.gserviceaccount.com]
module.portfolio.google_storage_bucket_iam_member.portfolio_public_access: Refreshing state... [id=b/stg-portfolio.piny940.com/roles/storage.objectViewer/allUsers]
module.portfolio.google_project_iam_member.portfolio_storage_object_user: Refreshing state... [id=stg-piny940/roles/storage.objectUser/serviceAccount:portfolio@stg-piny940.iam.gserviceaccount.com]
module.portfolio.google_service_account_iam_member.ksa_workload_identity_user: Refreshing state... [id=projects/stg-piny940/serviceAccounts/portfolio@stg-piny940.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/645068243364/locations/global/workloadIdentityPools/pool/subject/system:serviceaccount:default:stg-portfolio]
module.portfolio.google_project_iam_member.portfolio_service_account_token_creator: Refreshing state... [id=stg-piny940/roles/iam.serviceAccountTokenCreator/serviceAccount:portfolio@stg-piny940.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.velero.google_storage_bucket.velero must be replaced
-/+ resource "google_storage_bucket" "velero" {
      - default_event_based_hold    = false -> null
      - enable_object_retention     = false -> null
      ~ id                          = "stg-velero-cluster-backup.piny940.com" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "stg-velero-cluster-backup.piny940.com" -> "stg-velero-backup.piny940.com" # forces replacement
      ~ project                     = "stg-piny940" -> (known after apply)
      ~ project_number              = 645068243364 -> (known after apply)
      - requester_pays              = false -> null
      + rpo                         = (known after apply)
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/stg-velero-cluster-backup.piny940.com" -> (known after apply)
      ~ storage_class               = "NEARLINE" -> "STANDARD"
      ~ url                         = "gs://stg-velero-cluster-backup.piny940.com" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ soft_delete_policy (known after apply)
      - soft_delete_policy {
          - effective_time             = "2024-10-12T14:20:52.018Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      ~ versioning (known after apply)

      ~ website (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
<!-- Sticky Pull Request CommentGCP Plan for staging -->